<a href="https://colab.research.google.com/github/ocalzada/DS-Unit-1-Sprint-2-Data-Wrangling-and-Storytelling/blob/master/calzada%2C_oscar_LS_DS_121_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

_Lambda School Data Science_

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [2]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2019-08-12 20:09:57--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 54.231.82.148
Connecting to s3.amazonaws.com (s3.amazonaws.com)|54.231.82.148|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.2’

instacart_online_gr 100%[===================>] 196.03M  82.7MB/s    in 2.4s

2019-08-12 20:10:00 (82.7 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.2’ saved [205548478/205548478]

In [3]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [4]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [5]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

In [6]:
##### YOUR CODE HERE #####
import pandas as pd

order_products__prior = pd.read_csv('order_products__prior.csv')
print(order_products__prior.shape)
order_products__prior.head()

(32434489, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [7]:
order_products__train = pd.read_csv('order_products__train.csv')
print(order_products__train.shape)
order_products__train.head()

(1384617, 4)

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [8]:
#combine the order_products__prior and order_products__train dataframes/datasets
order_products = pd.concat([order_products__prior, order_products__train])
print(order_products.shape)
order_products.head()

(33819106, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [0]:
# check number of indices/rows is cummulative 
assert (order_products__prior.shape[0] + order_products__train.shape[0]) == order_products.shape[0]

In [10]:
# we need to merge products and order_products dfs

products = pd.read_csv('products.csv')
print(products.shape)
products.head()

(49688, 4)

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [11]:
orders = pd.read_csv('orders.csv')
print(orders.shape)
orders.head()

(3421083, 7)

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [13]:
columns = ['order_id', 'add_to_cart_order', 'product_id']
print(order_products.shape)
order_products[columns].head()

(33819106, 4)

   order_id  add_to_cart_order  product_id
0         2                  1       33120
1         2                  2       28985
2         2                  3        9327
3         2                  4       45918
4         2                  5       30035

In [0]:
final = pd.merge(products[['product_id', 'product_name']], order_products[columns], how='inner', on='product_id')
final

In [19]:
final['product_name'].value_counts(ascending=False)

Banana                                                                     491291
Bag of Organic Bananas                                                     394930
Organic Strawberries                                                       275577
Organic Baby Spinach                                                       251705
Organic Hass Avocado                                                       220877
Organic Avocado                                                            184224
Large Lemon                                                                160792
Strawberries                                                               149445
Limes                                                                      146660
Organic Whole Milk                                                         142813
Organic Raspberries                                                        142603
Organic Yellow Onion                                                       117716
Organic Garlic                                                             113936
Organic Zucchini                                                           109412
Organic Blueberries                                                        105026
Cucumber Kirby                                                              99728
Organic Fuji Apple                                                          92889
Organic Lemon                                                               91251
Organic Grape Tomatoes                                                      88078
Apple Honeycrisp Organic                                                    87272
Seedless Red Grapes                                                         86748
Organic Cucumber                                                            85005
Honeycrisp Apple                                                            83320
Organic Baby Carrots                                                        80493
Sparkling Water Grapefruit                                                  79245
Organic Half & Half                                                         79006
Organic Large Extra Fancy Fuji Apple                                        78056
Yellow Onions                                                               76929
Organic Baby Arugula                                                        75752
Organic Gala Apples                                                         75655
                                                                            ...
Anjou Pear Hand Soap                                                            1
Hennepin Farmhouse Ale                                                          1
Hot Chili with Beans                                                            1
Seasoned Southern Style Red Beans And Rice                                      1
Flavor Snacks                                                                   1
Orange Flavored Ice Cubes                                                       1
Pure Squeezed  Lemonade                                                         1
String Of Pearl White Sprinkles                                                 1
Water With Electrolytes                                                         1
Bite Size Caramel Chocolates                                                    1
Ultra Sun Blossom Liquid 90 loads Fabric Enhancers                              1
Skin Firming Cellulite Gel Cream                                                1
Greek Blended Cherry Fat Free Yogurt                                            1
Molasses, Bead                                                                  1
Strawberry Energy Gel                                                           1
Vitamin D Gummies                                                               1
Wicked Good No-Fry Wing Marinade                                                1
Coconut Bliss Pineapple Coconut                                                 1
Pure Peppermint Extract                                                         1
1,000 Mg Vitamin C Tangerine Grapefruit Effervescent Powdered Drink Mix         1
Yellow Fish Breading                                                            1
Max White With Polishing Star Soft Toothbrush                                   1
Original Lager                                                                  1
Microwavable Triple Cheese Macaroni & Cheese                                    1
Piquillo & Jalapeno Bruschetta                                                  1
Peachtree Schnapps                                                              1
Lindor Peppermint White Chocolate Truffles                                      1
Organic Veggie Ground                                                           1
Blueberry Blast Fruit and Chia Seed Bar                                         1
Imported Stout Draught Style                                                    1
Name: product_name, Length: 49685, dtype: int64

In [0]:
import seaborn as sns
flights = sns.load_dataset('flights')

In [0]:
##### YOUR CODE HERE #####
%matplotlib inline
import pandas as pd
import numpy as np

table1 = pd.DataFrame([[np.nan, 2],
                      [16,11],
                      [3,1]],
                      index = ['John Smith', 'Jane Doe', 'Mary Johnson'],
                      columns = ['treatmenta', 'treatmentb'])

table2 = table1.T

In [25]:
table1

              treatmenta  treatmentb
John Smith           NaN           2
Jane Doe            16.0          11
Mary Johnson         3.0           1

In [26]:
table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [27]:
table1.columns.to_list()

['treatmenta', 'treatmentb']

In [28]:
table1.index.to_list()

['John Smith', 'Jane Doe', 'Mary Johnson']

In [29]:
table1= table1.reset_index()
table1

          index  treatmenta  treatmentb
0    John Smith         NaN           2
1      Jane Doe        16.0          11
2  Mary Johnson         3.0           1

In [31]:
table1.index.to_list()

[0, 1, 2]

In [0]:
# tidy = table1.melt(id_)
?table1.melt

In [56]:
tidy = table1.melt(id_vars='index')
tidy

          index    variable  value
0    John Smith  treatmenta    NaN
1      Jane Doe  treatmenta   16.0
2  Mary Johnson  treatmenta    3.0
3    John Smith  treatmentb    2.0
4      Jane Doe  treatmentb   11.0
5  Mary Johnson  treatmentb    1.0

In [57]:
tidy = tidy.rename(columns={'index':'Name',
                           'variable': 'trt',
                           'value': 'Result'})

tidy

           Name         trt  Result
0    John Smith  treatmenta     NaN
1      Jane Doe  treatmenta    16.0
2  Mary Johnson  treatmenta     3.0
3    John Smith  treatmentb     2.0
4      Jane Doe  treatmentb    11.0
5  Mary Johnson  treatmentb     1.0

In [58]:
tidy.trt = tidy.trt.str.replace('treatment', ' ')
tidy

           Name trt  Result
0    John Smith   a     NaN
1      Jane Doe   a    16.0
2  Mary Johnson   a     3.0
3    John Smith   b     2.0
4      Jane Doe   b    11.0
5  Mary Johnson   b     1.0

In [59]:
table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [60]:
#create 'index' column
table2 = table2.reset_index()
table2

        index  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

In [61]:
tidy_t2 = table2.melt(id_vars='index')
tidy_t2

        index      variable  value
0  treatmenta    John Smith    NaN
1  treatmentb    John Smith    2.0
2  treatmenta      Jane Doe   16.0
3  treatmentb      Jane Doe   11.0
4  treatmenta  Mary Johnson    3.0
5  treatmentb  Mary Johnson    1.0

In [62]:
tidy_t2 = tidy_t2.rename(columns={'index': 'trt',
                                 'variable':'name',
                                 'value':'results'})

tidy_t2

          trt          name  results
0  treatmenta    John Smith      NaN
1  treatmentb    John Smith      2.0
2  treatmenta      Jane Doe     16.0
3  treatmentb      Jane Doe     11.0
4  treatmenta  Mary Johnson      3.0
5  treatmentb  Mary Johnson      1.0

In [63]:
tidy_t2.trt = tidy_t2.trt.str.replace('treatment', '')
tidy_t2

  trt          name  results
0   a    John Smith      NaN
1   b    John Smith      2.0
2   a      Jane Doe     16.0
3   b      Jane Doe     11.0
4   a  Mary Johnson      3.0
5   b  Mary Johnson      1.0

In [69]:
tidy_t2.pivot_table(index='name', columns='trt', values='results')

trt              a     b
name
Jane Doe      16.0  11.0
John Smith     NaN   2.0
Mary Johnson   3.0   1.0

In [68]:
tidy_t2.pivot_table(index='trt', columns='name', values='results')

name  Jane Doe  John Smith  Mary Johnson
trt
a         16.0         NaN           3.0
b         11.0         2.0           1.0

## Reshape Data Section

- Replicate the lesson code
- Complete the code cells we skipped near the beginning of the notebook
- Table 2 --> Tidy
- Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [0]:
import seaborn as sns
flights = sns.load_dataset('flights')

In [0]:
flights

In [80]:
flights = flights.pivot_table(index='year', columns='month')
flights

      passengers                       ...
month    January February March April  ... September October November December
year                                   ...
1949         112      118   132   129  ...       136     119      104      118
1950         115      126   141   135  ...       158     133      114      140
1951         145      150   178   163  ...       184     162      146      166
1952         171      180   193   181  ...       209     191      172      194
1953         196      196   236   235  ...       237     211      180      201
1954         204      188   235   227  ...       259     229      203      229
1955         242      233   267   269  ...       312     274      237      278
1956         284      277   317   313  ...       355     306      271      306
1957         315      301   356   348  ...       404     347      305      336
1958         340      318   362   348  ...       404     359      310      337
1959         360      342   406   396  ...       463     407      362      405
1960         417      391   419   461  ...       508     461      390      432

[12 rows x 12 columns]

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [0]:
##### YOUR CODE HERE #####

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####